tap "homebrew/bundle"
tap "homebrew/cask"
#tap "homebrew/core"

#CLI
brew "zsh"
#brew "tmux"
brew "git"
brew "neovim"
brew "curl"
brew "wget"
brew "exa"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "fzf"
brew "powerlevel10k"

#Languages
brew "python"
brew "lua"
brew "rust"
brew "terraform"

#MacOS Tools
cask "alfred"
cask "bartender"
cask "rectangle"
cask "appcleaner"

#Dev Tools
cask "visual-studio-code"
#cask "datagrip"
cask "iterm2"
#cask "docker"

#General Apps
cask "firefox"
cask "slack"
cask "1password"
cask "spotify"

#Vscode Extension
vscode "azemoh.one-monokai"
vscode "dvirtz.parquet-viewer"
vscode "eamodio.gitlens"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "PKief.material-icon-theme"
vscode "tamasfe.even-better-toml"
