tap "homebrew/bundle"
#tap "homebrew/core"

#Terminal
brew "zsh"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "tmux"
brew "neovim"
brew "lsd"
brew "bat"
brew "fzf"
brew "powerlevel10k"

#CLI Tools
brew "git"
brew "curl"
brew "just"
brew "pipx"
brew "pyenv"
brew "direnv"
brew "stow"
brew "tldr"

#Languages
brew "python@3.11"
brew "lua"
# brew "rust"
# brew "terraform"

#MacOS Tools
cask "alfred"
cask "rectangle"
cask "appcleaner"
cask "maccy"
cask "dozer"

#Dev Tools
cask "visual-studio-code"
cask "datagrip"
cask "iterm2"
cask "docker"

#General Apps
cask "firefox"
cask "slack"
cask "1password"
cask "spotify"
cask "obsidian"
cask "onedrive"

#Vscode Extension
vscode "bastienboutonnet.vscode-dbt"
vscode "eamodio.find-related"
vscode "eamodio.gitlens"
vscode "eliverlara.andromeda"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "kevinrose.vsc-python-indent"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "samuelcolvin.jinjahtml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "vscodevim.vim"
